IRP/src/Catalogs/LedgerTypes/LedgerTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>LedgerTypes</name>
 <attributes>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>LedgerTypeVariant</name>
  <type>
   <types>CatalogRef.LedgerTypeVariants</types>
  </type>
 </attributes>
 <attributes>
  <name>SourceLedgerType</name>
  <type>
   <types>CatalogRef.LedgerTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>IntegrationSettings</name>
  <type>
   <types>CatalogRef.IntegrationSettings</types>
  </type>
 </attributes>
 <attributes>
  <name>ELedgerLocalizationCode</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>5</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>PLOffset</name>
  <attributes>
   <name>FromAccount</name>
   <type>
    <types>ChartOfAccountsRef.Basic</types>
   </type>
  </attributes>
  <attributes>
   <name>BalanceType</name>
   <type>
    <types>EnumRef.AccountingAnalyticTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ToAccount</name>
   <type>
    <types>ChartOfAccountsRef.Basic</types>
   </type>
  </attributes>
  <attributes>
   <name>BySubAccounts</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/AccountingRegisters/Basic/Basic.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
 <name>Basic</name>
 <chartOfAccounts>ChartOfAccounts.Basic</chartOfAccounts>
 <correspondence>true</correspondence>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
  <balance>true</balance>
 </dimensions>
 <dimensions>
  <name>LedgerType</name>
  <type>
   <types>CatalogRef.LedgerTypes</types>
  </type>
  <balance>true</balance>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
  <balance>true</balance>
  <extDimensionAccountingFlag>ChartOfAccounts.Basic.ExtDimensionAccountingFlag.Amount</extDimensionAccountingFlag>
 </resources>
 <resources>
  <name>Quantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
  <accountingFlag>ChartOfAccounts.Basic.AccountingFlag.Quantity</accountingFlag>
  <extDimensionAccountingFlag>ChartOfAccounts.Basic.ExtDimensionAccountingFlag.Quantity</extDimensionAccountingFlag>
 </resources>
 <resources>
  <name>CurrencyAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
  <accountingFlag>ChartOfAccounts.Basic.AccountingFlag.Currency</accountingFlag>
  <extDimensionAccountingFlag>ChartOfAccounts.Basic.ExtDimensionAccountingFlag.Currency</extDimensionAccountingFlag>
 </resources>
 <attributes>
  <name>Operation</name>
  <type>
   <types>CatalogRef.AccountingOperations</types>
  </type>
 </attributes>
 <attributes>
  <name>IsFixed</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>IsByRow</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Key</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </attributes>
</mdclass:AccountingRegister>

IRP/src/Enums/AccountingAnalyticTypes/AccountingAnalyticTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>AccountingAnalyticTypes</name>
 <enumValues>
  <name>Debit</name>
 </enumValues>
 <enumValues>
  <name>Credit</name>
 </enumValues>
</mdclass:Enum>

IRP/src/ChartsOfAccounts/Basic/Basic.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
 <name>Basic</name>
 <extDimensionTypes>ChartOfCharacteristicTypes.AccountingExtraDimensionTypes</extDimensionTypes>
 <attributes>
  <name>LedgerTypeVariant</name>
  <type>
   <types>CatalogRef.LedgerTypeVariants</types>
  </type>
 </attributes>
 <attributes>
  <name>SearchCode</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>12</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>NotUsedForRecords</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>AccountCategory</name>
  <type>
   <types>EnumRef.AccountCategories</types>
  </type>
 </attributes>
 <accountingFlags>
  <name>Quantity</name>
  <type>
   <types>Boolean</types>
  </type>
 </accountingFlags>
 <accountingFlags>
  <name>Currency</name>
  <type>
   <types>Boolean</types>
  </type>
 </accountingFlags>
 <extDimensionAccountingFlags>
  <name>Quantity</name>
  <type>
   <types>Boolean</types>
  </type>
 </extDimensionAccountingFlags>
 <extDimensionAccountingFlags>
  <name>Currency</name>
  <type>
   <types>Boolean</types>
  </type>
 </extDimensionAccountingFlags>
 <extDimensionAccountingFlags>
  <name>Amount</name>
  <type>
   <types>Boolean</types>
  </type>
 </extDimensionAccountingFlags>
 <extDimensionAccountingFlags>
  <name>ELedgerDetailed</name>
  <type>
   <types>Boolean</types>
  </type>
 </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

IRP/src/Catalogs/LedgerTypes/ManagerModule.bsl
#Region RegularAccountingOperations

Function ProfitLostOffset(Company, LedgerType, Ref, Date, DeletionMark, RegisterRecords) Export
	Query = New Query();
	Query.Text = 
	"SELECT
	|	LedgerTypesPLOffset.FromAccount,
	|	LedgerTypesPLOffset.BalanceType,
	|	LedgerTypesPLOffset.ToAccount,
	|	LedgerTypesPLOffset.BySubAccounts
	|FROM
	|	Catalog.LedgerTypes.PLOffset AS LedgerTypesPLOffset
	|WHERE
	|	LedgerTypesPLOffset.Ref = &LedgerType
	|
	|ORDER BY
	|	LedgerTypesPLOffset.LineNumber";
	
	Query.SetParameter("LedgerType", LedgerType);
	
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	
	DataTable = AccountingServer.CreateAccountingDataTable();
	
	While QuerySelection.Next() Do
		BalanceTable = GetAccountBalance(Company, LedgerType, Ref, Date, 
			QuerySelection.FromAccount, 
			QuerySelection.BalanceType,
			QuerySelection.BySubAccounts);
		
		ToAccountsTable = GetToAccountsTable(QuerySelection.ToAccount);
		
		AccountIndex = -1;
		For Each BalanceRow In BalanceTable Do
			AccountIndex = AccountIndex + 1;
			If Not ValueIsFilled(BalanceRow.AmountBalance) Then
				Continue;
			EndIf;
			
			Record = DataTable.Add();
			Record.Period  = Date;
			Record.Company = Company;
			Record.LedgerType  = LedgerType;
			
			Record.Amount = BalanceRow.AmountBalance;
			
			If ToAccountsTable.Count()-1 >= AccountIndex Then
				ToAccount = ToAccountsTable[AccountIndex].Ref;
			Else
				ToAccount = ToAccountsTable[ToAccountsTable.Count()-1].Ref;
			EndIf;
			
			FromAccount = BalanceRow.Account;
			
			// Dr ToAccount Cr FromAccount
			If QuerySelection.BalanceType = Enums.AccountingAnalyticTypes.Debit Then
				FillDebit(ToAccount, Record, BalanceRow, FromAccount);
				FillCredit(FromAccount, Record, BalanceRow);
			// Dr FromAccount Cr ToAccount
			Else
				FillDebit(FromAccount, Record, BalanceRow);
				FillCredit(ToAccount, Record, BalanceRow, FromAccount);				
			EndIf;
			
		EndDo;
		
		RegisterRecords.Clear();
		AccountingServer.SetDataRegisterRecords(DataTable, LedgerType, RegisterRecords);
		For Each Record In RegisterRecords Do
			Record.Active = Not DeletionMark;
		EndDo;
		RegisterRecords.Write();
	EndDo;
	
	Return DataTable;
EndFunction
	
Function GetAccountBalance(Company, LedgerType, Ref, Date, Account, BalanceType, BySubAccounts)
	Query = New Query();
	Query.Text = 
	"SELECT
	|	BasicBalance.Account AS Account,
	|	BasicBalance.Company AS Company,
	|	BasicBalance.LedgerType AS LedgerType,
	|	BasicBalance.ExtDimension1 AS ExtDimension1,
	|	BasicBalance.ExtDimension2 AS ExtDimension2,
	|	BasicBalance.ExtDimension3 AS ExtDimension3,
	|	BasicBalance.Currency AS Currency,
	|	CASE
	|		WHEN &BalanceType = VALUE(enum.AccountingAnalyticTypes.Debit)
	|			THEN BasicBalance.AmountBalanceDr
	|		WHEN &BalanceType = VALUE(enum.AccountingAnalyticTypes.Credit)
	|			THEN BasicBalance.AmountBalanceCr
	|	END AS AmountBalance,
	|	CASE
	|		WHEN &BalanceType = VALUE(enum.AccountingAnalyticTypes.Debit)
	|			THEN BasicBalance.CurrencyAmountBalanceDr
	|		WHEN &BalanceType = VALUE(enum.AccountingAnalyticTypes.Credit)
	|			THEN BasicBalance.CurrencyAmountBalanceCr
	|	END AS CurrencyAmountBalance,
	|	CASE
	|		WHEN &BalanceType = VALUE(enum.AccountingAnalyticTypes.Debit)
	|			THEN BasicBalance.QuantityBalanceDr
	|		WHEN &BalanceType = VALUE(enum.AccountingAnalyticTypes.Credit)
	|			THEN BasicBalance.QuantityBalanceCr
	|	END AS QuantityBalance
	|FROM
	|	AccountingRegister.Basic.Balance(&BalancePeriod, CASE
	|		WHEN &BySubAccounts
	|			THEN Account IN HIERARCHY (&Account)
	|		ELSE Account = &Account
	|	END,, Company = &Company
	|	AND LedgerType = &LedgerType) AS BasicBalance
	|
	|ORDER BY
	|	BasicBalance.Account.Order";
	
	Query.SetParameter("BalanceType"  , BalanceType);
	Query.SetParameter("Account"      , Account);
	Query.SetParameter("BySubAccounts", BySubAccounts);
	Query.SetParameter("Company"      , Company);
	Query.SetParameter("LedgerType"   , LedgerType);
	Query.SetParameter("Account"      , Account);
	
	Query.SetParameter("BalancePeriod", New Boundary(Ref.PointInTime(), BoundaryType.Including));
	
	QueryResult = Query.Execute();
	QueryTable = QueryResult.Unload();
	
	Return QueryTable;
EndFunction

Function GetToAccountsTable(Account)
	Query = New Query();
	Query.Text = 
	"SELECT
	|	Basic.Ref AS Ref
	|FROM
	|	ChartOfAccounts.Basic AS Basic
	|WHERE
	|	Basic.Ref IN HIERARCHY (&Account)
	|	AND NOT Basic.NotUsedForRecords
	|
	|ORDER BY
	|	Basic.Order";
	
	Query.SetParameter("Account", Account);
	
	QueryResult = Query.Execute();
	QueryTable = QueryResult.Unload();
	
	Return QueryTable;
EndFunction

Procedure FillDebit(Account, Record, Source, MatchAccount = Undefined)
	FillAnalytics("Dr", Account, Record, Source, MatchAccount);
EndProcedure

Procedure FillCredit(Account, Record, Source, MatchAccount = Undefined)
	FillAnalytics("Cr", Account, Record, Source, MatchAccount);
EndProcedure

Procedure FillAnalytics(AccountType, Account, Record, Source, MatchAccount)
	Record["Account" + AccountType] = Account;
	
	If MatchAccount <> Undefined Then
		MatchExtDimType1 = AccountingServer.GetExtDimType_ByNumber(1, MatchAccount);
		MatchExtDimType2 = AccountingServer.GetExtDimType_ByNumber(2, MatchAccount);
		MatchExtDimType3 = AccountingServer.GetExtDimType_ByNumber(3, MatchAccount);
		
		NumberExtDim1 = String(AccountingServer.GetExtDimNumber_ByType(MatchExtDimType1, Account));
		NumberExtDim2 = String(AccountingServer.GetExtDimNumber_ByType(MatchExtDimType2, Account));
		NumberExtDim3 = String(AccountingServer.GetExtDimNumber_ByType(MatchExtDimType3, Account));
		
		If ValueIsFilled(NumberExtDim1) Then
			Record["ExtDim" + AccountType+ "Type"  + String(NumberExtDim1)] = MatchExtDimType1;
			Record["ExtDim" + AccountType+ "Value" + String(NumberExtDim1)] = Source.ExtDimension1;
		EndIf;
		
		If ValueIsFilled(NumberExtDim2) Then
			Record["ExtDim" + AccountType+ "Type"  + String(NumberExtDim2)] = MatchExtDimType2;
			Record["ExtDim" + AccountType+ "Value" + String(NumberExtDim2)] = Source.ExtDimension2;
		EndIf;
		
		If ValueIsFilled(NumberExtDim3) Then
			Record["ExtDim" + AccountType+ "Type"  + String(NumberExtDim3)] = MatchExtDimType3;
			Record["ExtDim" + AccountType+ "Value" + String(NumberExtDim3)] = Source.ExtDimension3;
		EndIf;
	
	Else
		Record["ExtDim" + AccountType + "Type1"] = AccountingServer.GetExtDimType_ByNumber(1, Account);
		Record["ExtDim" + AccountType + "Type2"] = AccountingServer.GetExtDimType_ByNumber(2, Account);
		Record["ExtDim" + AccountType + "Type3"] = AccountingServer.GetExtDimType_ByNumber(3, Account);
				
		Record["ExtDim" + AccountType + "Value1"] = Source.ExtDimension1;
		Record["ExtDim" + AccountType + "Value2"] = Source.ExtDimension2;
		Record["ExtDim" + AccountType + "Value3"] = Source.ExtDimension3;
	EndIf;
				
	Record["Currency" + AccountType] = Source.Currency;
	Record["CurrencyAmount" + AccountType] = Source.CurrencyAmountBalance;
	Record["Quantity" + AccountType] = Source.QuantityBalance;
EndProcedure

#EndRegion
